#include<stdio.h>
#include<windows.h>
#include<stdlib.h>
#include<time.h>
#include <mmsystem.h>
#include <conio.h>

#define scanf scanf_s
#pragma comment(lib,"winmm.lib")
#define UP 72
#define DOWN 80
#define LEFT 75
#define RIGHT 77 
int my = 5000, hp = 100, mr = 800, st, bhp, gum = 1;


void CursorView()
{
	CONSOLE_CURSOR_INFO cursorInfo = { 0, };
	cursorInfo.dwSize = 1;
	cursorInfo.bVisible = FALSE;
	SetConsoleCursorInfo(GetStdHandle(STD_OUTPUT_HANDLE), &cursorInfo);
}

ed(int x, int y) {
	COORD pos = { x, y };
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
}
int keeper(int map[60][60], int X, int Y) {
	int checker;
	if (map[Y][X] == 0) checker = 0;
	else if (map[Y][X] == 2) checker = 2;
	else if (map[Y][X] == 3) checker = 3;
	else if (map[Y][X] == 4) checker = 4;
	else checker = 1;
	return checker;
}
int main() {
	system("mode con cols=200 lines=200");
	srand((unsigned int)time(NULL));
	int a, s, test, m, v,z,q;
	char k;
	int X = 10, Y = 10;
	PlaySound(TEXT("pp.wav"), NULL, SND_ASYNC);
	printf("(한적한 오후 나는 길을 걷고 있었다.)\n");
	scanf("%c", &k);
	printf("(그때, 어린아이가 도로를 건너고 있었다.)\n");
	printf("\n");
	printf("빵빵");
	Sleep(3500);
	PlaySound("NULL", 0, 0);
	printf("\n주인공: 위험해!");
	scanf("%c", &k);
	printf("쾅!!\n");
	scanf("%c", &k);
	printf("주인공:크윽,여긴 어디지?\n");
	scanf("%c", &k);
	printf("왕:용사여 정신이 드는가?\n");
	scanf("%c", &k);
	printf("주인공: 여긴 어디죠?\n그리고 제가 왜 용사죠?\n");
	scanf("%c", &k);
	printf("왕: 여기는 메디올리눔이라네, 그리고 자네는 지난날 마왕과 싸우다 큰 부상을 입었지\n이제 기억이 나는가?\n");
	scanf("%c", &k);
	printf("주인공: ??\n");
	scanf("%c", &k);
	printf("왕: 지금 왕국의 운명이 자네에게 달렸네,헤르만이 한달전 왕실도서관에서 모렐로노미콘을 훔쳐 도망쳤다네\n");
	scanf("%c", &k);
	printf("헤르만을 잡아 모렐로노미콘을 회수한다면 내가 큰 보상을 주겠네\n");
	scanf("%c", &k);
	printf("주인공: 마왕을 잡은 후 말씀드리죠\n");
	scanf("%c", &k);
	printf("왕: 좋네, 나라를 구해준다면 원하는것 무엇이든 주지!!\n");
	scanf("%c", &k);
	printf("주인공: 그럼지금 당장 떠나겠습니다. ㅂㅂ\n");
	scanf("%c", &k);
	printf("왕: 잠깐, 가기전에 싸울 채비를 해야지 여기 공격력800의 검을 주겠네\n혹시 더 원하는게 있나\n");
	scanf("%c", &k);
	printf("주인공: 대장간을 하나 지어주세요\n");
	scanf("%c", &k);
	printf("왕: 좋네 어디 설지하고 싶은지 얘기해보게나\n");
	printf("(대장간은 2~58사이에 설치할수 있습니다. 처음에는 x좌표 그다음에 y좌표를 입력해주세요)\n");
sixten:
	scanf("%d %d", &a, &s);
	if (a >= 59 || a <= 1 || s >= 59 || s <= 1) {
		printf("다시 입력하게!!");
		Sleep(800);
		goto sixten;
	}
	int map[60][60] = {
	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1} };
	map[s][a] = 3;
	map[1][58] = 4;
sjqq:
	z = rand() % 58 + 1;
	q = rand() % 58 + 1;
	map[q][z] = 2;
	PlaySound(TEXT("qq.wav"), NULL, SND_ASYNC);
	system("cls");
	ed(0, 0);
	for (int i = 0; i < 60; i++) {
		for (int j = 0; j < 60; j++) {
			if (map[i][j] == 1) {
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_GREEN | FOREGROUND_INTENSITY);
				printf("=");
			}
			else {
				printf(" ");
			}
		}
		printf("\n");
	}
	ed(X, Y);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_BLUE | FOREGROUND_INTENSITY);
	printf("O");
	ed(70, 0);
	printf("돈:%d", my);
	ed(70, 1);
	printf("피:%d", hp);
	ed(70, 2);
	printf("검 공격력:%d", mr);
	while (1) {
		ed(58, 1);
		printf("+");
		ed(a, s);
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_RED | FOREGROUND_INTENSITY);
		printf("@");
		ed(z, q);
		printf("*");
		test = _getch();
		CursorView();
		switch (test) {
		case UP: ed(X, Y);
			printf(" ");
			Y--;
			m = keeper(map, X, Y);
			if (m == 1) {
				Y++;
			}
			if (m == 2) {
				PlaySound("NULL", 0, 0);
				goto qwe;
			}
			if (m == 3) {
				PlaySound("NULL", 0, 0);
				goto djg;
			}
			if (m == 4) {
				PlaySound("NULL", 0, 0);
				goto bss;
			}
			ed(X, Y);
			SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_BLUE | FOREGROUND_INTENSITY);
			printf("0");
			break;
		case DOWN: ed(X, Y);
			printf(" ");
			Y++;
			m = keeper(map, X, Y);
			if (m == 1) {
				Y--;
			}
			if (m == 2) {
				PlaySound("NULL", 0, 0);
				goto qwe;
			}
			if (m == 3) {
				PlaySound("NULL", 0, 0);
				goto djg;
			}
			if (m == 4) {
				PlaySound("NULL", 0, 0);
				goto bss;
			}
			ed(X, Y);
			SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_BLUE | FOREGROUND_INTENSITY);
			printf("0");
			break;
		case LEFT: ed(X, Y);
			printf(" ");
			X--;
			m = keeper(map, X, Y);
			if (m == 1) {
				X++;
			}
			if (m == 2) {
				PlaySound("NULL", 0, 0);
				goto qwe;
			}
			if (m == 3) {
				PlaySound("NULL", 0, 0);
				goto djg;
			}
			if (m == 4) {
				PlaySound("NULL", 0, 0);
				goto bss;
			}
			ed(X, Y);
			SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_BLUE | FOREGROUND_INTENSITY);
			printf("0");
			break;
		case RIGHT: ed(X, Y);
			printf(" ");
			X++;
			m = keeper(map, X, Y);
			if (m == 1) {
				X--;
			}
			if (m == 2) {
				PlaySound("NULL", 0, 0);
				goto qwe;
			}
			if (m == 3) {
				PlaySound("NULL", 0, 0);
				goto djg;
			}
			if (m == 4) {
				PlaySound("NULL", 0, 0);
				goto bss;
			}
			ed(X, Y);
			SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), FOREGROUND_BLUE | FOREGROUND_INTENSITY);
			printf("0");
		}
	}
qwe: //싸움
	PlaySound(TEXT("ss.wav"), NULL, SND_ASYNC);
	system("cls");
	bhp = 750;
	ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                               ⊂_ヽ                                 │\n");
	printf("│                                               　 ＼＼ Λ＿Λ                       │\n");
	printf("│                                                     ＼('ㅅ') 두둠칫                │\n");
	printf("│                                                       >　⌒ヽ                       │\n");
	printf("│                                                      / 　 へ＼                     │\n");
	printf("│                                                     /　　/　＼＼                   │\n");
	printf("│                                                     ﾚ　ノ　　 ヽ_つ                 │\n");
	printf("│                                                    /　/두둠칫                      │\n");
	printf("│                                                   /　/|                            │\n");
	printf("│                                                　(　(ヽ                             │\n");
	printf("│                                                　|　|、＼                          │\n");
	printf("│                                                　| 丿 ＼ ⌒)                        │\n");
	printf("│                                                　| |　　) /                        │\n");
	printf("│                                                 ノ )　　Lﾉ                         │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│  1. 싸우기                                                                         │\n");
	printf("│  2.도망치기                                                                        │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(90, 0);
	printf("돈:%d", my);
	ed(90, 1);
	printf("피:%d", hp);
	ed(90, 2);
	printf("검 공격력:%d", mr);
	ed(67, 1);
	printf("hp:%d", bhp);
ag:
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1: goto so; break;
	case 2: goto sjqq; break;
	default: printf("잘못된 입력\n"); goto ag;
	}
so:ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                               ⊂_ヽ                                 │\n");
	printf("│                                               　 ＼＼ Λ＿Λ                       │\n");
	printf("│                                                     ＼('ㅅ') 두둠칫                │\n");
	printf("│                                                       >　⌒ヽ                       │\n");
	printf("│                                                      / 　 へ＼                     │\n");
	printf("│                                                     /　　/　＼＼                   │\n");
	printf("│                                                     ﾚ　ノ　　 ヽ_つ                 │\n");
	printf("│                                                    /　/두둠칫                      │\n");
	printf("│                                                   /　/|                            │\n");
	printf("│                                                　(　(ヽ                             │\n");
	printf("│                                                　|　|、＼                          │\n");
	printf("│                                                　| 丿 ＼ ⌒)                        │\n");
	printf("│                                                　| |　　) /                        │\n");
	printf("│                                                 ノ )　　Lﾉ                         │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│  1.베어가르기            3.회복                                                    │\n");
	printf("│  2.찌르기                4.도망치기                                                │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(67, 1);
	printf("hp:%d", bhp);
re:
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1: printf("\n베어가르기를 사용했다...");
		bhp -= (mr - 100);
		ed(67, 1);
		printf("hp:%d", bhp);
		if (bhp <= 0) {
			ed(0, 27);
			printf("\n고양이: 크윽\n");
			scanf("%c", &k);
			printf("적을 무찔렀다.");
			my += 1000;
			PlaySound("NULL", 0, 0);
			scanf("%c", &k);
			goto sjqq;
			break;
		}
		else {
			ed(0, 27);
			scanf("%c", &k);
			printf("\n고양이가 할퀴기를 사용했다");
			hp -= 200;
			ed(90, 1);
			printf("피:%d", hp);
			scanf("%c", &k);
			ed(0, 28);
			printf("\n효과는 강력했다!!\n너 죽음ㅋㅋ");
			PlaySound("NULL", 0, 0);
			scanf("%c", &k);
			return 0;
			break;
		}

	case 2: printf("찌르기를 사용했다\n");
		bhp -= (mr + 100);
		ed(67, 1);
		printf("hp:%d", bhp);
		scanf("%c", &k);
		ed(0, 27);
		printf("고양이: 크윽\n");
		scanf("%c", &k);
		printf("적을 무찔렀다.");
		PlaySound("NULL", 0, 0);
		my += 1000;
		scanf("%c", &k);
		goto sjqq;
		break;
	case 3: printf("\n회복을 사용했다");
		scanf("%c", &k);
		hp += 50;
		ed(90, 1);
		printf("피:%d", hp);
		printf("고양이가 할퀴기를 사용했다");
		scanf("%c", &k);
		hp -= 200;
		ed(90, 1);
		printf("피:%d", hp);
		ed(0, 28);
		printf("효과는 강력했다!!\n너 죽음ㅋㅋ");
		PlaySound("NULL", 0, 0);
		scanf("%c", &k);
		return 0;
		break;
	case 4: goto sjqq; break;
	default: printf("잘못된 입력\n"); goto re;
	}
djg:
	system("cls");
	ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");		printf("│                                                                                    │\n");
	printf("│ 대장간에 어서오게나!                                                               │\n");
	printf("│ 검을 강화하러 왔나?                                                                │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│ 1.네                                                                               │\n");
	printf("│ 2.아니오                                                                           │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(90, 0);
	printf("돈:%d", my);
	ed(90, 1);
	printf("피:%d", hp);
	ed(90, 2);
	printf("검 공격력:%d", mr);
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1: goto dj; break;
	case 2:
		printf("그럼 나가!!");
		scanf("%c", &k);
		goto sjqq;
		break;
	default: printf("다시 선택하게나");
		scanf("%c", &k);
		goto djg;
	}
dj:
	system("cls");
	ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");		printf("│                                                                                    │\n");
	printf("│ 검 강화 비용은 5200원이네!                                                         │\n");
	printf("│ 하겠나?                                                                            │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│ 1.네                                                                               │\n");
	printf("│ 2.아니오                                                                           │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(90, 0);
	printf("돈:%d", my);
	ed(90, 1);
	printf("피:%d", hp);
	ed(90, 2);
	printf("검 공격력:%d", mr);
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1:
		if (my < 5200) {
			printf("\n돈 없으면 나가!!");
			scanf("%c", &k);
			goto sjqq;
		}
		else {
			v = z % 10;
			if (v == 3) {
				printf("\n어이쿠..손이 미끄러졌네");
				scanf("%c", &k);
				printf("\n당신은 검을 부셔먹어서 모험을 떠날 수 없게 되었습니다.");
				scanf("%c", &k);
				return 0;
			}
			else {
				printf("\n검이 강화되었습니다.");
				mr += 2000;
				my -= 5200;
				ed(90, 0);
				printf("돈:%d", my);
				ed(90, 2);
				printf("검 공격력:%d", mr);
				scanf("%c", &k);
				goto sjqq;
			}
		}
		break;
	case 2:
		goto sjqq;
		break;
	}
bss:
	PlaySound(TEXT("33.wav"), NULL, SND_ASYNC);
	system("cls");
	bhp = 2500;
	ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                      ∧＿∧                        │\n");
	printf("│                                                ,.-､（ ^∀^ ）_                     │\n");
	printf("│                                              　|~~| 　 ∨　 ＿_|二二二つ           │\n");
	printf("│                                              　!-.|'ヽ　 　　 ＼                    │\n");
	printf("│                                              　 ヽ._ノ ＼　 　ヽ                     │\n");
	printf("│                                                         ヽ. _ ／}                   │\n");
	printf("│                                                            ∨　/                   │\n");
	printf("│                                                            /　/ヽ                   │\n");
	printf("│                                                          ./　/ヽ　ヽ                 │\n");
	printf("│                                                          │ | 　＼ ＼               │\n");
	printf("│                                                          │ |　　 ＼ ＼             │\n");
	printf("│                                             ／ ￣ ＼.　 {__.!   　  ＼.）          │\n");
	printf("│                                             !  　∴|                               │\n");
	printf("│                                             ＼ ＿ ／                               │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│  1. 싸우기                                                                         │\n");
	printf("│  2.도망치기                                                                        │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(90, 0);
	printf("돈:%d", my);
	ed(90, 1);
	printf("피:%d", hp);
	ed(90, 2);
	printf("검 공격력:%d", mr);
	ed(67, 1);
	printf("hp:%d", bhp);
qaz:
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1:goto zx;
		break;
	case 2:goto sjqq;
		break;
	default: printf("잘못된 입력");
		goto qaz;
	}
zx:
	system("cls");
	ed(0, 0);
	printf("┌────────────────────────────────────────────────────────────────────────────────────┐\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                      ∧＿∧                        │\n");
	printf("│                                                ,.-､（ ^∀^ ）_                     │\n");
	printf("│                                              　|~~| 　 ∨　 ＿_|二二二つ           │\n");
	printf("│                                              　!-.|'ヽ　 　　 ＼                    │\n");
	printf("│                                              　 ヽ._ノ ＼　 　ヽ                     │\n");
	printf("│                                                         ヽ. _ ／}                   │\n");
	printf("│                                                            ∨　/                   │\n");
	printf("│                                                            /　/ヽ                   │\n");
	printf("│                                                          ./　/ヽ　ヽ                 │\n");
	printf("│                                                          │ | 　＼ ＼               │\n");
	printf("│                                                          │ |　　 ＼ ＼             │\n");
	printf("│                                             ／ ￣ ＼.　 {__.!   　  ＼.）          │\n");
	printf("│                                             !  　∴|                               │\n");
	printf("│                                             ＼ ＿ ／                               │\n");
	printf("├────────────────────────────────────────────────────────────────────────────────────┤\n");
	printf("│  1.강타                    3.찌르기                                                │\n");
	printf("│  2.도망치기                4.마왕의 수하되기                                       │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("│                                                                                    │\n");
	printf("└────────────────────────────────────────────────────────────────────────────────────┘\n");
	ed(90, 0);
	printf("돈:%d", my);
	ed(90, 1);
	printf("피:%d", hp);
	ed(90, 2);
	printf("검 공격력:%d", mr);
	ed(67, 1);
	printf("hp:%d", bhp);
hg:
	ed(0, 25);
	scanf("%d", &st);
	switch (st) {
	case 1:printf("\n강타를 사용했다.\n");
		scanf("%c", &k);
		printf("(미끌)\n");
		bhp -= (mr - 700);
		ed(67, 1);
		printf("hp:%d", bhp);
		if (bhp > 0) {
			scanf("%c", &k);
			ed(0, 29);
			printf("고양이:목을 노렸어야지..\n");
			scanf("%c", &k);
			printf("마왕이 불꽃슛을 던졌다.\n");
			hp -= 2000;
			ed(90, 1);
			printf("피:%d", hp);
			ed(0, 30);
			printf("\n효과는 강력했다!!\n너 죽음ㅋㅋ");
			PlaySound("NULL", 0, 0);
			scanf("%c", &k);
			return 0;
		}
		else {
			ed(0, 29);
			printf("고양이: 크윽\n");
			scanf("%c", &k);
			printf("마왕을 무찔렀다.");
			PlaySound("NULL", 0, 0);
			my += 100000;
			scanf("%c", &k);
			goto end;
		}
		break;
	case 2: goto sjqq;
		break;
	case 3: printf("\n찌르기를 사용했다\n");
		bhp -= mr;
		ed(67, 1);
		printf("hp:%d", bhp);
		scanf("%c", &k);
		ed(0, 28);
		printf("고양이: 크윽\n");
		scanf("%c", &k);
		printf("마왕을 무찔렀다.");
		PlaySound("NULL", 0, 0);
		my += 100000;
		scanf("%c", &k);
		goto end;
		break;
	case 4: printf("\n잠깐 우리 싸우지 말자\n");
		scanf("%c", &k);
		printf("고양이: ?\n");
		scanf("%c", &k);
		printf("\n싫은데 씹새꺄\n");
		scanf("%c", &k);
		printf("마왕이 불꽃슛을 던졌다.");
		hp -= 2000;
		ed(90, 1);
		printf("피:%d", hp);
		ed(0, 28);
		printf("\n효과는 강력했다!!\n너 죽음ㅋㅋ");
		PlaySound("NULL", 0, 0);
		scanf("%c", &k);
		return 0;
		break;
	default: printf("잘못된 입력\n"); goto hg;
	}
end:
	system("cls");
	PlaySound(TEXT("zz.wav"), NULL, SND_ASYNC);
	ed(0, 0);
	printf("주인공: 해치웠나?\n");
	scanf("%c", &k);
	printf("왕:(깡)플래그 세우지마!!\n");
	scanf("%c", &k);
	printf("주인공: 아, ㅈㅅ\n");
	scanf("%c", &k);
	printf("왕: 마왕을 잡았으니 갖고 싶은걸 말해보게나\n");
	scanf("%c", &k);
	printf("주인공: 저는 이세계 사람이 아닙니다. 저를 원래 살던 세계로 보내주세요\n");
	scanf("%c", &k);
	printf("왕: 알겠네, 거기 가만히 서있게나\nCossamus etronum\n");
	scanf("%c", &k);
	printf("콰광과광광\n");
	scanf("%c", &k);
	printf("주인공: (두리번두리번)여기는 내가 사고를 당한곳?\n");
	scanf("%c", &k);
	printf("어린애: 아죠씨 구해주셔서 감사합니다\n");
	scanf("%c", &k);
	printf("주인공: 그래, 다음부터는 조심해라\n");
	scanf("%c", &k);
	printf("주인공: (집으로 돌아간 후) 하, 여러므로 이상한 하루였어.\n아주 긴꿈을 꾼걸까?\n");
	scanf("%c", &k);
	printf("\n\n(☆플레이 해주셔서 감사합니다.☆)");
	PlaySound("NULL", 0, 0);
	return 0;
}